[Killed] BlockStatement
hw3-handout/src/lib/CoveyTownController.ts:124:23
     this._sessions = this._sessions.filter(s => s.sessionToken !== session.sessionToken);
     this._listeners.forEach(listener => listener.onPlayerDisconnected(session.player));
     const conversation = session.player.activeConversationArea;
-    if (conversation) {
-      this.removePlayerFromConversationArea(session.player, conversation);
-    }
+    if (conversation) {}
   }
 
killedBy: CoveyTownController destroySession should remove from the conversation area when player session is destroyed
statusReason: Error: expect(received).toBeUndefined()

Received: "BW5QP371zGc5UVOA5wAKO"

[Killed] ConditionalExpression
hw3-handout/src/lib/CoveyTownController.ts:140:62
    * @param location New location for this player
    */
   updatePlayerLocation(player: Player, location: UserLocation): void {
-    const conversation = this.conversationAreas.find(conv => conv.label === location.conversationLabel);
+    const conversation = this.conversationAreas.find(conv => true);
     const prevConversation = player.activeConversationArea;
 
killedBy: CoveyTownController updatePlayerLocation should respect the conversation area reported by the player userLocation.conversationLabel, and not override it based on the player's x,y location
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "B9pN8jfZddd99tM8e9a13"
Received: "DbzCijD3TdXoMidZBXYTX"

[Killed] ArrowFunction
hw3-handout/src/lib/CoveyTownController.ts:140:54
    * @param location New location for this player
    */
   updatePlayerLocation(player: Player, location: UserLocation): void {
-    const conversation = this.conversationAreas.find(conv => conv.label === location.conversationLabel);
+    const conversation = this.conversationAreas.find(() => undefined);
     const prevConversation = player.activeConversationArea;
 
killedBy: CoveyTownController updatePlayerLocation should respect the conversation area reported by the player userLocation.conversationLabel, and not override it based on the player's x,y location
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "UwMCRsU9XYulDlmlwAAKM"
Received: undefined

[Killed] ConditionalExpression
hw3-handout/src/lib/CoveyTownController.ts:146:9
     player.location = location;
     player.activeConversationArea = conversation;
 
-    if (conversation !== prevConversation) {
+    if (true) {
       if (prevConversation) {
         this.removePlayerFromConversationArea(player, prevConversation);
killedBy: CoveyTownController updatePlayerLocation checks to see if the conversation area is still present after player moving location
statusReason: TypeError: Cannot read properties of undefined (reading 'occupantsByID')

[Killed] BlockStatement
hw3-handout/src/lib/CoveyTownController.ts:146:44
     player.location = location;
     player.activeConversationArea = conversation;
 
-    if (conversation !== prevConversation) {
-      if (prevConversation) {
-        this.removePlayerFromConversationArea(player, prevConversation);
-      }
-      if (conversation) {
-        conversation.occupantsByID.push(player.id);
-        this._listeners.forEach(listener => listener.onConversationAreaUpdated(conversation));
-      }
-    }
+    if (conversation !== prevConversation) {}
 
     this._listeners.forEach(listener => listener.onPlayerMoved(player));
killedBy: CoveyTownController updatePlayerLocation should emit an onConversationUpdated event when a conversation area gets a new occupant
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
hw3-handout/src/lib/CoveyTownController.ts:147:29
     player.activeConversationArea = conversation;
 
     if (conversation !== prevConversation) {
-      if (prevConversation) {
-        this.removePlayerFromConversationArea(player, prevConversation);
-      }
+      if (prevConversation) {}
       if (conversation) {
         conversation.occupantsByID.push(player.id);
killedBy: CoveyTownController updatePlayerLocation it should ensure that the conversationArea list reflects player transitions from conversationAreas
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 2

[Killed] BlockStatement
hw3-handout/src/lib/CoveyTownController.ts:150:25
       if (prevConversation) {
         this.removePlayerFromConversationArea(player, prevConversation);
       }
-      if (conversation) {
-        conversation.occupantsByID.push(player.id);
-        this._listeners.forEach(listener => listener.onConversationAreaUpdated(conversation));
-      }
+      if (conversation) {}
     }
 
killedBy: CoveyTownController updatePlayerLocation should emit an onConversationUpdated event when a conversation area gets a new occupant
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ArrowFunction
hw3-handout/src/lib/CoveyTownController.ts:152:33
       }
       if (conversation) {
         conversation.occupantsByID.push(player.id);
-        this._listeners.forEach(listener => listener.onConversationAreaUpdated(conversation));
+        this._listeners.forEach(() => undefined);
       }
     }
killedBy: CoveyTownController updatePlayerLocation should emit an onConversationUpdated event when a conversation area gets a new occupant
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ArrowFunction
hw3-handout/src/lib/CoveyTownController.ts:156:29
       }
     }
 
-    this._listeners.forEach(listener => listener.onPlayerMoved(player));
+    this._listeners.forEach(() => undefined);
   }
 
killedBy: CoveyTownController town listeners and events should notify added listeners of player movement when updatePlayerLocation is called
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"_activeConversationArea": undefined, "_id": "N95oZWOedEWbFJwQxhs-K", "_userName": "test player", "location": {"moving": true, "rotation": "back", "x": 29, "y": 28}}

Number of calls: 0

[Killed] EqualityOperator
hw3-handout/src/lib/CoveyTownController.ts:169:79
    * @param conversation Conversation area to remove player from
    */
   removePlayerFromConversationArea(player: Player, conversation: ServerConversationArea) : void {
-    conversation.occupantsByID.splice(conversation.occupantsByID.findIndex(p=>p === player.id), 1);
+    conversation.occupantsByID.splice(conversation.occupantsByID.findIndex(p=>p !== player.id), 1);
     if (conversation.occupantsByID.length === 0) {
       this._conversationAreas.splice(this._conversationAreas.findIndex(conv => conv === conversation), 1);
killedBy: CoveyTownController updatePlayerLocation checks to see if the player has been removed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: undefined
Received: "RI4E5OGix_U9pk-GF46ft"

[Killed] ConditionalExpression
hw3-handout/src/lib/CoveyTownController.ts:169:79
    * @param conversation Conversation area to remove player from
    */
   removePlayerFromConversationArea(player: Player, conversation: ServerConversationArea) : void {
-    conversation.occupantsByID.splice(conversation.occupantsByID.findIndex(p=>p === player.id), 1);
+    conversation.occupantsByID.splice(conversation.occupantsByID.findIndex(p=>false), 1);
     if (conversation.occupantsByID.length === 0) {
       this._conversationAreas.splice(this._conversationAreas.findIndex(conv => conv === conversation), 1);
killedBy: CoveyTownController updatePlayerLocation checks to see if the player has been removed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: undefined
Received: "LMY4Keipv6Dj5hkJK3UBY"

[Killed] EqualityOperator
hw3-handout/src/lib/CoveyTownController.ts:170:9
    */
   removePlayerFromConversationArea(player: Player, conversation: ServerConversationArea) : void {
     conversation.occupantsByID.splice(conversation.occupantsByID.findIndex(p=>p === player.id), 1);
-    if (conversation.occupantsByID.length === 0) {
+    if (conversation.occupantsByID.length !== 0) {
       this._conversationAreas.splice(this._conversationAreas.findIndex(conv => conv === conversation), 1);
       this._listeners.forEach(listener => listener.onConversationAreaDestroyed(conversation));
killedBy: CoveyTownController updatePlayerLocation it should ensure that the conversationArea list reflects player transitions from conversationAreas
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 2

[Killed] ConditionalExpression
hw3-handout/src/lib/CoveyTownController.ts:170:9
    */
   removePlayerFromConversationArea(player: Player, conversation: ServerConversationArea) : void {
     conversation.occupantsByID.splice(conversation.occupantsByID.findIndex(p=>p === player.id), 1);
-    if (conversation.occupantsByID.length === 0) {
+    if (true) {
       this._conversationAreas.splice(this._conversationAreas.findIndex(conv => conv === conversation), 1);
       this._listeners.forEach(listener => listener.onConversationAreaDestroyed(conversation));
killedBy: CoveyTownController updatePlayerLocation checks to see if the player has been removed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: undefined
Received: "50USug-tKuYVfOqAgPaNv"

[Killed] EqualityOperator
hw3-handout/src/lib/CoveyTownController.ts:171:80
   removePlayerFromConversationArea(player: Player, conversation: ServerConversationArea) : void {
     conversation.occupantsByID.splice(conversation.occupantsByID.findIndex(p=>p === player.id), 1);
     if (conversation.occupantsByID.length === 0) {
-      this._conversationAreas.splice(this._conversationAreas.findIndex(conv => conv === conversation), 1);
+      this._conversationAreas.splice(this._conversationAreas.findIndex(conv => conv !== conversation), 1);
       this._listeners.forEach(listener => listener.onConversationAreaDestroyed(conversation));
     } else {
killedBy: CoveyTownController updatePlayerLocation it should ensure that the conversationArea list reflects player transitions from conversationAreas
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "miD5qTmuRQGJi2r20lkv0"
Received: undefined

[Killed] ConditionalExpression
hw3-handout/src/lib/CoveyTownController.ts:171:80
   removePlayerFromConversationArea(player: Player, conversation: ServerConversationArea) : void {
     conversation.occupantsByID.splice(conversation.occupantsByID.findIndex(p=>p === player.id), 1);
     if (conversation.occupantsByID.length === 0) {
-      this._conversationAreas.splice(this._conversationAreas.findIndex(conv => conv === conversation), 1);
+      this._conversationAreas.splice(this._conversationAreas.findIndex(conv => false), 1);
       this._listeners.forEach(listener => listener.onConversationAreaDestroyed(conversation));
     } else {
killedBy: CoveyTownController updatePlayerLocation it should ensure that the conversationArea list reflects player transitions from conversationAreas
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "0W38we1DdIuR7QiEpBs99"
Received: undefined

[Killed] ArrowFunction
hw3-handout/src/lib/CoveyTownController.ts:172:31
     conversation.occupantsByID.splice(conversation.occupantsByID.findIndex(p=>p === player.id), 1);
     if (conversation.occupantsByID.length === 0) {
       this._conversationAreas.splice(this._conversationAreas.findIndex(conv => conv === conversation), 1);
-      this._listeners.forEach(listener => listener.onConversationAreaDestroyed(conversation));
+      this._listeners.forEach(() => undefined);
     } else {
       this._listeners.forEach(listener => listener.onConversationAreaUpdated(conversation));
killedBy: CoveyTownController updatePlayerLocation it should ensure that the conversationArea list reflects player transitions from conversationAreas
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
hw3-handout/src/lib/CoveyTownController.ts:173:12
     if (conversation.occupantsByID.length === 0) {
       this._conversationAreas.splice(this._conversationAreas.findIndex(conv => conv === conversation), 1);
       this._listeners.forEach(listener => listener.onConversationAreaDestroyed(conversation));
-    } else {
-      this._listeners.forEach(listener => listener.onConversationAreaUpdated(conversation));
-    }
+    } else {}
   }
 
killedBy: CoveyTownController updatePlayerLocation checks to see if the player has been removed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 4
Received number of calls: 3

[Killed] ArrowFunction
hw3-handout/src/lib/CoveyTownController.ts:174:31
       this._conversationAreas.splice(this._conversationAreas.findIndex(conv => conv === conversation), 1);
       this._listeners.forEach(listener => listener.onConversationAreaDestroyed(conversation));
     } else {
-      this._listeners.forEach(listener => listener.onConversationAreaUpdated(conversation));
+      this._listeners.forEach(() => undefined);
     }
   }
killedBy: CoveyTownController updatePlayerLocation checks to see if the player has been removed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 4
Received number of calls: 3

[Killed] ConditionalExpression
hw3-handout/src/lib/CoveyTownController.ts:192:9
    * @returns true if the conversation is successfully created, or false if not
    */
   addConversationArea(_conversationArea: ServerConversationArea): boolean {
-    if (this._conversationAreas.find(
-      eachExistingConversation => eachExistingConversation.label === _conversationArea.label,
-    ))
+    if (false)
       return false;
     if (_conversationArea.topic === ''){
killedBy: CoveyTownController addConversationArea ensures that a conversation area is not added if the same label exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
hw3-handout/src/lib/CoveyTownController.ts:192:9
    * @returns true if the conversation is successfully created, or false if not
    */
   addConversationArea(_conversationArea: ServerConversationArea): boolean {
-    if (this._conversationAreas.find(
-      eachExistingConversation => eachExistingConversation.label === _conversationArea.label,
-    ))
+    if (true)
       return false;
     if (_conversationArea.topic === ''){
killedBy: CoveyTownController addConversationArea should add the conversation area to the list of conversation areas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrowFunction
hw3-handout/src/lib/CoveyTownController.ts:193:7
    */
   addConversationArea(_conversationArea: ServerConversationArea): boolean {
     if (this._conversationAreas.find(
-      eachExistingConversation => eachExistingConversation.label === _conversationArea.label,
+      () => undefined,
     ))
       return false;
killedBy: CoveyTownController addConversationArea ensures that a conversation area is not added if the same label exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
hw3-handout/src/lib/CoveyTownController.ts:193:35
    */
   addConversationArea(_conversationArea: ServerConversationArea): boolean {
     if (this._conversationAreas.find(
-      eachExistingConversation => eachExistingConversation.label === _conversationArea.label,
+      eachExistingConversation => false,
     ))
       return false;
killedBy: CoveyTownController addConversationArea ensures that a conversation area is not added if the same label exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
hw3-handout/src/lib/CoveyTownController.ts:195:14
     if (this._conversationAreas.find(
       eachExistingConversation => eachExistingConversation.label === _conversationArea.label,
     ))
-      return false;
+      return true;
     if (_conversationArea.topic === ''){
       return false;
killedBy: CoveyTownController addConversationArea ensures that a conversation area is not added if the same label exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
hw3-handout/src/lib/CoveyTownController.ts:196:9
       eachExistingConversation => eachExistingConversation.label === _conversationArea.label,
     ))
       return false;
-    if (_conversationArea.topic === ''){
+    if (_conversationArea.topic !== ''){
       return false;
     }
killedBy: CoveyTownController addConversationArea should add the conversation area to the list of conversation areas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
hw3-handout/src/lib/CoveyTownController.ts:196:9
       eachExistingConversation => eachExistingConversation.label === _conversationArea.label,
     ))
       return false;
-    if (_conversationArea.topic === ''){
+    if (true){
       return false;
     }
killedBy: CoveyTownController addConversationArea should add the conversation area to the list of conversation areas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[NoCoverage] BooleanLiteral
hw3-handout/src/lib/CoveyTownController.ts:197:14
     ))
       return false;
     if (_conversationArea.topic === ''){
-      return false;
+      return true;
     }
     if (this._conversationAreas.find(eachExistingConversation => 

[Killed] ConditionalExpression
hw3-handout/src/lib/CoveyTownController.ts:199:9
     if (_conversationArea.topic === ''){
       return false;
     }
-    if (this._conversationAreas.find(eachExistingConversation => 
-      CoveyTownController.boxesOverlap(eachExistingConversation.boundingBox, _conversationArea.boundingBox)) !== undefined){
+    if (false){
       return false;
     }
killedBy: CoveyTownController addConversationArea should not add a conversation area that overlaps with other conversation areas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrowFunction
hw3-handout/src/lib/CoveyTownController.ts:199:38
     if (_conversationArea.topic === ''){
       return false;
     }
-    if (this._conversationAreas.find(eachExistingConversation => 
-      CoveyTownController.boxesOverlap(eachExistingConversation.boundingBox, _conversationArea.boundingBox)) !== undefined){
+    if (this._conversationAreas.find(() => undefined) !== undefined){
       return false;
     }
killedBy: CoveyTownController addConversationArea should not add a conversation area that overlaps with other conversation areas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
hw3-handout/src/lib/CoveyTownController.ts:200:124
       return false;
     }
     if (this._conversationAreas.find(eachExistingConversation => 
-      CoveyTownController.boxesOverlap(eachExistingConversation.boundingBox, _conversationArea.boundingBox)) !== undefined){
-      return false;
-    }
+      CoveyTownController.boxesOverlap(eachExistingConversation.boundingBox, _conversationArea.boundingBox)) !== undefined){}
     const newArea :ServerConversationArea = Object.assign(_conversationArea);
     this._conversationAreas.push(newArea);
killedBy: CoveyTownController addConversationArea should not add a conversation area that overlaps with other conversation areas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
hw3-handout/src/lib/CoveyTownController.ts:201:14
     }
     if (this._conversationAreas.find(eachExistingConversation => 
       CoveyTownController.boxesOverlap(eachExistingConversation.boundingBox, _conversationArea.boundingBox)) !== undefined){
-      return false;
+      return true;
     }
     const newArea :ServerConversationArea = Object.assign(_conversationArea);
killedBy: CoveyTownController addConversationArea should not add a conversation area that overlaps with other conversation areas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrowFunction
hw3-handout/src/lib/CoveyTownController.ts:205:59
     }
     const newArea :ServerConversationArea = Object.assign(_conversationArea);
     this._conversationAreas.push(newArea);
-    const playersInThisConversation = this.players.filter(player => player.isWithin(newArea));
+    const playersInThisConversation = this.players.filter(() => undefined);
     playersInThisConversation.forEach(player => {player.activeConversationArea = newArea;});
     newArea.occupantsByID = playersInThisConversation.map(player => player.id);
killedBy: CoveyTownController addConversationArea checks to see if a player is added to the bounding box of the new conversation area
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] BlockStatement
hw3-handout/src/lib/CoveyTownController.ts:206:49
     const newArea :ServerConversationArea = Object.assign(_conversationArea);
     this._conversationAreas.push(newArea);
     const playersInThisConversation = this.players.filter(player => player.isWithin(newArea));
-    playersInThisConversation.forEach(player => {player.activeConversationArea = newArea;});
+    playersInThisConversation.forEach(player => {});
     newArea.occupantsByID = playersInThisConversation.map(player => player.id);
     this._listeners.forEach(listener => listener.onConversationAreaUpdated(newArea));
killedBy: CoveyTownController addConversationArea checks to see if a player is added to the bounding box of the new conversation area
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"boundingBox": {"height": 2, "width": 2, "x": 0, "y": 0}, "label": "MfJPBcm5i8WHaThczUtAY", "occupantsByID": ["ICZWofbDC7pHACdXBaP3K", "szwIuQEEipQ5s3jRJcSJw"], "topic": "6N95LN1E3KT9WsOcMoVAp"}
Received: undefined

[Killed] ArrowFunction
hw3-handout/src/lib/CoveyTownController.ts:208:29
     const playersInThisConversation = this.players.filter(player => player.isWithin(newArea));
     playersInThisConversation.forEach(player => {player.activeConversationArea = newArea;});
     newArea.occupantsByID = playersInThisConversation.map(player => player.id);
-    this._listeners.forEach(listener => listener.onConversationAreaUpdated(newArea));
+    this._listeners.forEach(() => undefined);
     return true;
   }
killedBy: CoveyTownController updatePlayerLocation it should ensure that the conversationArea list reflects player transitions from conversationAreas
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 3
Received number of calls: 2

[Killed] BooleanLiteral
hw3-handout/src/lib/CoveyTownController.ts:209:12
     playersInThisConversation.forEach(player => {player.activeConversationArea = newArea;});
     newArea.occupantsByID = playersInThisConversation.map(player => player.id);
     this._listeners.forEach(listener => listener.onConversationAreaUpdated(newArea));
-    return true;
+    return false;
   }
 
killedBy: CoveyTownController addConversationArea should add the conversation area to the list of conversation areas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
hw3-handout/src/lib/CoveyTownController.ts:221:137
    */
   static boxesOverlap(box1: BoundingBox, box2: BoundingBox):boolean{
     // Helper function to extract the top left (x1,y1) and bottom right corner (x2,y2) of each bounding box
-    const toRectPoints = (box: BoundingBox) => ({ x1: box.x - box.width / 2, x2: box.x + box.width / 2, y1: box.y - box.height / 2, y2: box.y + box.height / 2 });
+    const toRectPoints = (box: BoundingBox) => ({ x1: box.x - box.width / 2, x2: box.x + box.width / 2, y1: box.y - box.height / 2, y2: box.y - box.height / 2 });
     const rect1 = toRectPoints(box1);
     const rect2 = toRectPoints(box2);
killedBy: CoveyTownController addConversationArea should not add a conversation area that overlaps with other conversation areas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArithmeticOperator
hw3-handout/src/lib/CoveyTownController.ts:221:63
    */
   static boxesOverlap(box1: BoundingBox, box2: BoundingBox):boolean{
     // Helper function to extract the top left (x1,y1) and bottom right corner (x2,y2) of each bounding box
-    const toRectPoints = (box: BoundingBox) => ({ x1: box.x - box.width / 2, x2: box.x + box.width / 2, y1: box.y - box.height / 2, y2: box.y + box.height / 2 });
+    const toRectPoints = (box: BoundingBox) => ({ x1: box.x - box.width * 2, x2: box.x + box.width / 2, y1: box.y - box.height / 2, y2: box.y + box.height / 2 });
     const rect1 = toRectPoints(box1);
     const rect2 = toRectPoints(box2);
killedBy: CoveyTownController addConversationArea checks to see if the adjacent conversation area bounding boxes overlaps
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
hw3-handout/src/lib/CoveyTownController.ts:224:23
     const toRectPoints = (box: BoundingBox) => ({ x1: box.x - box.width / 2, x2: box.x + box.width / 2, y1: box.y - box.height / 2, y2: box.y + box.height / 2 });
     const rect1 = toRectPoints(box1);
     const rect2 = toRectPoints(box2);
-    const noOverlap = rect1.x1 >= rect2.x2 || rect2.x1 >= rect1.x2 || rect1.y1 >= rect2.y2 || rect2.y1 >= rect1.y2;
+    const noOverlap = (rect1.x1 >= rect2.x2 || rect2.x1 >= rect1.x2) && rect1.y1 >= rect2.y2 || rect2.y1 >= rect1.y2;
     return !noOverlap;
   }
killedBy: CoveyTownController addConversationArea checks to see if the adjacent conversation area bounding boxes overlaps
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
hw3-handout/src/lib/CoveyTownController.ts:224:47
     const toRectPoints = (box: BoundingBox) => ({ x1: box.x - box.width / 2, x2: box.x + box.width / 2, y1: box.y - box.height / 2, y2: box.y + box.height / 2 });
     const rect1 = toRectPoints(box1);
     const rect2 = toRectPoints(box2);
-    const noOverlap = rect1.x1 >= rect2.x2 || rect2.x1 >= rect1.x2 || rect1.y1 >= rect2.y2 || rect2.y1 >= rect1.y2;
+    const noOverlap = rect1.x1 >= rect2.x2 || rect2.x1 > rect1.x2 || rect1.y1 >= rect2.y2 || rect2.y1 >= rect1.y2;
     return !noOverlap;
   }
killedBy: CoveyTownController addConversationArea checks to see if the adjacent conversation area bounding boxes overlaps
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
hw3-handout/src/lib/CoveyTownController.ts:225:12
     const rect1 = toRectPoints(box1);
     const rect2 = toRectPoints(box2);
     const noOverlap = rect1.x1 >= rect2.x2 || rect2.x1 >= rect1.x2 || rect1.y1 >= rect2.y2 || rect2.y1 >= rect1.y2;
-    return !noOverlap;
+    return noOverlap;
   }
 
killedBy: CoveyTownController addConversationArea checks to see if the adjacent conversation area bounding boxes overlaps
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
