[Killed] BlockStatement
hw3-handout/src/router/towns.ts:112:9
   });
 
   app.post('/towns/:townID/conversationAreas', express.json(), async (req, res) => {
-    try {
-      const result = await conversationAreaCreateHandler({
-        coveyTownID: req.params.townID,
-        sessionToken: req.body.sessionToken,
-        conversationArea: req.body.conversationArea,
-      });
-      res.status(StatusCodes.OK)
-        .json(result);
-    } catch (err) {
+    try {} catch (err) {
       logError(err);
       res.status(StatusCodes.INTERNAL_SERVER_ERROR)
killedBy: Create Conversation Area API Executes without error when creating a new conversation
statusReason: : Timeout - Async callback was not invoked within the 5000 ms timeout specified by jest.setTimeout.Timeout - Async callback was not invoked within the 5000 ms timeout specified by jest.setTimeout.Error:

[Killed] BlockStatement
hw3-handout/src/router/towns.ts:120:19
       });
       res.status(StatusCodes.OK)
         .json(result);
-    } catch (err) {
-      logError(err);
-      res.status(StatusCodes.INTERNAL_SERVER_ERROR)
-        .json({
-          message: 'Internal server error, please see log in server for more details',
-        });
-    }
+    } catch (err) {}
   });
 
killedBy: Create Conversation Area API ensures that the error message is stated and the HTTP status codes are correctly matched
statusReason: : Timeout - Async callback was not invoked within the 5000 ms timeout specified by jest.setTimeout.Timeout - Async callback was not invoked within the 5000 ms timeout specified by jest.setTimeout.Error:
