[Killed] ConditionalExpression
hw3-handout/src/types/Player.ts:58:7
    */
   isWithin(conversation: ServerConversationArea) : boolean {
     return (
-      this.location.x > conversation.boundingBox.x - conversation.boundingBox.width / 2 &&
-      this.location.x < conversation.boundingBox.x + conversation.boundingBox.width / 2 &&
-      this.location.y > conversation.boundingBox.y - conversation.boundingBox.height / 2 &&
-      this.location.y < conversation.boundingBox.y + conversation.boundingBox.height / 2
+      false
     );
   }
killedBy: CoveyTownController addConversationArea checks to see if a player is added to the bounding box of the new conversation area
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] ArithmeticOperator
hw3-handout/src/types/Player.ts:58:54
    */
   isWithin(conversation: ServerConversationArea) : boolean {
     return (
-      this.location.x > conversation.boundingBox.x - conversation.boundingBox.width / 2 &&
+      this.location.x > conversation.boundingBox.x - conversation.boundingBox.width * 2 &&
       this.location.x < conversation.boundingBox.x + conversation.boundingBox.width / 2 &&
       this.location.y > conversation.boundingBox.y - conversation.boundingBox.height / 2 &&
killedBy: CoveyTownController addConversationArea checks that the player is not in the left boundary of the conversation area
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] EqualityOperator
hw3-handout/src/types/Player.ts:59:7
   isWithin(conversation: ServerConversationArea) : boolean {
     return (
       this.location.x > conversation.boundingBox.x - conversation.boundingBox.width / 2 &&
-      this.location.x < conversation.boundingBox.x + conversation.boundingBox.width / 2 &&
+      this.location.x >= conversation.boundingBox.x + conversation.boundingBox.width / 2 &&
       this.location.y > conversation.boundingBox.y - conversation.boundingBox.height / 2 &&
       this.location.y < conversation.boundingBox.y + conversation.boundingBox.height / 2
killedBy: CoveyTownController addConversationArea checks to see if a player is added to the bounding box of the new conversation area
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] ArithmeticOperator
hw3-handout/src/types/Player.ts:59:54
   isWithin(conversation: ServerConversationArea) : boolean {
     return (
       this.location.x > conversation.boundingBox.x - conversation.boundingBox.width / 2 &&
-      this.location.x < conversation.boundingBox.x + conversation.boundingBox.width / 2 &&
+      this.location.x < conversation.boundingBox.x + conversation.boundingBox.width * 2 &&
       this.location.y > conversation.boundingBox.y - conversation.boundingBox.height / 2 &&
       this.location.y < conversation.boundingBox.y + conversation.boundingBox.height / 2
killedBy: CoveyTownController addConversationArea should not add any players who are to the right of the bounding box to the newly created conversation area
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ArithmeticOperator
hw3-handout/src/types/Player.ts:60:25
     return (
       this.location.x > conversation.boundingBox.x - conversation.boundingBox.width / 2 &&
       this.location.x < conversation.boundingBox.x + conversation.boundingBox.width / 2 &&
-      this.location.y > conversation.boundingBox.y - conversation.boundingBox.height / 2 &&
+      this.location.y > conversation.boundingBox.y + conversation.boundingBox.height / 2 &&
       this.location.y < conversation.boundingBox.y + conversation.boundingBox.height / 2
     );
killedBy: CoveyTownController addConversationArea checks to see if a player is added to the bounding box of the new conversation area
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] EqualityOperator
hw3-handout/src/types/Player.ts:60:7
     return (
       this.location.x > conversation.boundingBox.x - conversation.boundingBox.width / 2 &&
       this.location.x < conversation.boundingBox.x + conversation.boundingBox.width / 2 &&
-      this.location.y > conversation.boundingBox.y - conversation.boundingBox.height / 2 &&
+      this.location.y >= conversation.boundingBox.y - conversation.boundingBox.height / 2 &&
       this.location.y < conversation.boundingBox.y + conversation.boundingBox.height / 2
     );
killedBy: CoveyTownController addConversationArea checks that the player is not in the bottom boundary of the conversation area
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ArithmeticOperator
hw3-handout/src/types/Player.ts:61:25
       this.location.x > conversation.boundingBox.x - conversation.boundingBox.width / 2 &&
       this.location.x < conversation.boundingBox.x + conversation.boundingBox.width / 2 &&
       this.location.y > conversation.boundingBox.y - conversation.boundingBox.height / 2 &&
-      this.location.y < conversation.boundingBox.y + conversation.boundingBox.height / 2
+      this.location.y < conversation.boundingBox.y - conversation.boundingBox.height / 2
     );
   }
killedBy: CoveyTownController addConversationArea checks to see if a player is added to the bounding box of the new conversation area
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] EqualityOperator
hw3-handout/src/types/Player.ts:61:7
       this.location.x > conversation.boundingBox.x - conversation.boundingBox.width / 2 &&
       this.location.x < conversation.boundingBox.x + conversation.boundingBox.width / 2 &&
       this.location.y > conversation.boundingBox.y - conversation.boundingBox.height / 2 &&
-      this.location.y < conversation.boundingBox.y + conversation.boundingBox.height / 2
+      this.location.y <= conversation.boundingBox.y + conversation.boundingBox.height / 2
     );
   }
killedBy: CoveyTownController addConversationArea checks to see if a player is on the boundary of the bounding box top in order to ensure they are not added to convo area
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1
