[Killed] EqualityOperator
hw3-handout/src/lib/CoveyTownController.ts:193:35
    */
   addConversationArea(_conversationArea: ServerConversationArea): boolean {
     if (this._conversationAreas.find(
-      eachExistingConversation => eachExistingConversation.label === _conversationArea.label,
+      eachExistingConversation => eachExistingConversation.label !== _conversationArea.label,
     ))
       return false;
killedBy: CoveyTownController updatePlayerLocation should respect the conversation area reported by the player userLocation.conversationLabel, and not override it based on the player's x,y location
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
hw3-handout/src/lib/CoveyTownController.ts:193:35
    */
   addConversationArea(_conversationArea: ServerConversationArea): boolean {
     if (this._conversationAreas.find(
-      eachExistingConversation => eachExistingConversation.label === _conversationArea.label,
+      eachExistingConversation => true,
     ))
       return false;
killedBy: CoveyTownController updatePlayerLocation should respect the conversation area reported by the player userLocation.conversationLabel, and not override it based on the player's x,y location
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
hw3-handout/src/lib/CoveyTownController.ts:199:9
     if (_conversationArea.topic === ''){
       return false;
     }
-    if (this._conversationAreas.find(eachExistingConversation => 
-      CoveyTownController.boxesOverlap(eachExistingConversation.boundingBox, _conversationArea.boundingBox)) !== undefined){
+    if (this._conversationAreas.find(eachExistingConversation => CoveyTownController.boxesOverlap(eachExistingConversation.boundingBox, _conversationArea.boundingBox)) === undefined){
       return false;
     }
killedBy: Create Conversation Area API Executes without error when creating a new conversation
statusReason: Error: Error processing request: Unable to create conversation area ptAD977_MTFmWG-UlMb6m with topic rMwdl51WcQb9TD5YvRzhb

[Killed] ConditionalExpression
hw3-handout/src/lib/CoveyTownController.ts:199:9
     if (_conversationArea.topic === ''){
       return false;
     }
-    if (this._conversationAreas.find(eachExistingConversation => 
-      CoveyTownController.boxesOverlap(eachExistingConversation.boundingBox, _conversationArea.boundingBox)) !== undefined){
+    if (true){
       return false;
     }
killedBy: CoveyTownController addConversationArea should add the conversation area to the list of conversation areas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
hw3-handout/src/lib/CoveyTownController.ts:224:23
     const toRectPoints = (box: BoundingBox) => ({ x1: box.x - box.width / 2, x2: box.x + box.width / 2, y1: box.y - box.height / 2, y2: box.y + box.height / 2 });
     const rect1 = toRectPoints(box1);
     const rect2 = toRectPoints(box2);
-    const noOverlap = rect1.x1 >= rect2.x2 || rect2.x1 >= rect1.x2 || rect1.y1 >= rect2.y2 || rect2.y1 >= rect1.y2;
+    const noOverlap = false;
     return !noOverlap;
   }
killedBy: CoveyTownController updatePlayerLocation should respect the conversation area reported by the player userLocation.conversationLabel, and not override it based on the player's x,y location
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] EqualityOperator
hw3-handout/src/lib/CoveyTownController.ts:224:23
     const toRectPoints = (box: BoundingBox) => ({ x1: box.x - box.width / 2, x2: box.x + box.width / 2, y1: box.y - box.height / 2, y2: box.y + box.height / 2 });
     const rect1 = toRectPoints(box1);
     const rect2 = toRectPoints(box2);
-    const noOverlap = rect1.x1 >= rect2.x2 || rect2.x1 >= rect1.x2 || rect1.y1 >= rect2.y2 || rect2.y1 >= rect1.y2;
+    const noOverlap = rect1.x1 > rect2.x2 || rect2.x1 >= rect1.x2 || rect1.y1 >= rect2.y2 || rect2.y1 >= rect1.y2;
     return !noOverlap;
   }
