[Killed] ConditionalExpression
hw3-handout/src/types/Player.ts:58:7
    */
   isWithin(conversation: ServerConversationArea) : boolean {
     return (
-      this.location.x > conversation.boundingBox.x - conversation.boundingBox.width / 2 &&
-      this.location.x < conversation.boundingBox.x + conversation.boundingBox.width / 2 &&
-      this.location.y > conversation.boundingBox.y - conversation.boundingBox.height / 2 &&
+      true &&
       this.location.y < conversation.boundingBox.y + conversation.boundingBox.height / 2
     );
killedBy: CoveyTownController updatePlayerLocation it should ensure that the conversationArea list reflects player transitions from conversationAreas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -1
Received: 0
